In [1]:
import mysql.connector
import pandas as pd

In [2]:
connection = mysql.connector.connect(host = "localhost",
                                     user = "root",
                                     passwd = "shivam12")
cursorObj = connection.cursor()

In [3]:
createDB = """CREATE DATABASE e_commerce"""

cursorObj.execute(createDB)

In [4]:
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="shivam12",
                                     database = 'e_commerce')
 
## creating a cursor object

cursorObj = connection.cursor()

In [5]:
table_creation_query = """CREATE TABLE supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10));
                          CREATE TABLE customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));
                          CREATE TABLE category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID));
                          CREATE TABLE product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));
                          CREATE TABLE product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));
                          CREATE TABLE order_details(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID));
                          CREATE TABLE rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
cursorObj.execute(table_creation_query)

In [6]:
connection.close()

connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="shivam",
                                     database = 'e_commerce')
 
## creating a cursor object

cursorObj = connection.cursor()

In [7]:
# insert into "supplier" table
insert_supplier = """INSERT INTO supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE)VALUES(%s, %s, %s, %s)"""

val = [(1,'Rajesh Retails', 'Delhi',1234567890),(2,'Appario Ltd.', 'Mumbai',8963147032),(3,'Knome products', 'Bangalore',9785462315),(4,'Bansal Retails', 'Kochi', 8975463285),(5,'Mittal Ltd.', 'Lucknow', 7898456532)]

cursorObj.executemany(insert_supplier, val)
connection.commit()

In [8]:
# insert into "customer" table

insert_customer = """INSERT INTO customer (CUS_ID , CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER)VALUES (%s, %s, %s, %s, %s)"""

val = [(1,'AKASH',1234567890, 'Delhi', 'M'),
       (2,'AMAN',1614322387, 'NOIDA', 'M'),
       (3,'NEHA',1871614322, 'Mumbai', 'F'),
       (4,'MEGHA', 1000614322, 'KOLKATA', 'F'),
       (5,'PULKIT', 1614322551, 'Lucknow','M')]
   
cursorObj.executemany(insert_customer, val)
connection.commit()

In [9]:
# insert into "categoty" table
insert_category = """ INSERT INTO category (CAT_ID, CAT_NAME) 
                        VALUES 
                        (1, 'BOOKS'),
                        (2, 'GAMES'),
                        (3, 'GROCERIES'),
                        (4, 'ELECTRONICS'),
                        (5, 'CLOTHES');"""

cursorObj.execute(insert_category)
connection.commit()

In [10]:
# Inserting Values into "product" table

insert_query = "INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V","DFJDJFDJFDJFDJFJF",2),
       (2,"TSHIRT","DFDFJDFJDKFD",5),
       (3,"ROG LAPTOP","DFNTTNTNTERND",4),
       (4,"OATS","REURENTBTOTH",3),
       (5,"HARRY POTTER","NBEMCTHTJTH",1)]


cursorObj.executemany(insert_query, val)
connection.commit()

In [11]:
# insert into "product_details" table
insert_product_details = "INSERT INTO product_details( PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE)VALUES (%s, %s, %s, %s)"
val = [(1,1,2,1500),
       (2,3,5,30000),
       (3,5,1,3000),
       (4,2,3,2500),
       (5,4,1,1000)]


cursorObj.executemany(insert_product_details, val)
connection.commit()

In [12]:
# insert into "orders" table
insert_query = "INSERT INTO order_details (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20,1500,"2021-10-12",3,5),
       (25,30500,"2021-09-16",5,2),
       (26,2000,"2021-10-05",1,1),
       (30,3500,"2021-08-16",4,3),
       (50,2000,"2021-10-06",2,1)]


cursorObj.executemany(insert_query, val)
connection.commit()

In [13]:
# insert into "rating" table
insert_query = "INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1,2,2,4),
       (2,3,4,3),
       (3,5,1,5),
       (4,1,3,2),
       (5,4,5,4)]


cursorObj.executemany(insert_query, val)
connection.commit()

In [14]:
Query3 = """select count(c.CUS_ID) as Number_of_customers, c.CUS_GENDER as gender from customer c 
            right join
            (select CUS_ID,ORD_AMOUNT from order_details where ORD_AMOUNT>= 3000) as o
            on c.cus_id = o.CUS_ID group by CUS_GENDER;"""

cursorObj.execute(Query3)

output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['Number_of_customers','gender'])
output_df

   Number_of_customers gender
0                    1      M
1                    1      F

In [15]:
Query4 = """select o.cus_id, o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE, pro.pro_name from order_details o 
            inner join
            (select p.pro_name, pd.prod_id from product p 
            inner join 
            product_details pd on p.PRO_ID = pd.PRO_ID ) as pro 
            on o.prod_id = pro.PROD_ID having o.cus_id = 2;"""

cursorObj.execute(Query4)

output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['Customer_Id','Order_Id', 'Amount', 'Date', 'Product Name'])
output_df

   Customer_Id  Order_Id  Amount        Date Product Name
0            2        50    2000  2021-10-06        GTA V

In [16]:
Query5 = """SELECT  sp.SUPP_ID, sp.SUPP_NAME, sp.SUPP_CITY, sp.SUPP_PHONE  FROM supplier AS sp
            INNER JOIN 
            (SELECT distinct SUPP_ID FROM product_details p
            GROUP BY SUPP_ID HAVING COUNT(SUPP_ID) > 1  ) as sd
            ON sp.SUPP_ID = sd.SUPP_ID;"""

cursorObj.execute(Query5)

output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['Supplier Id','Supplier Name', 'Supplier City', 'Supplier Phone'])
output_df

   Supplier Id   Supplier Name Supplier City Supplier Phone
0            1  Rajesh Retails         Delhi     1234567890

In [17]:
Query6 = """select c.CAT_ID, c.CAT_NAME from category c 
            inner join 
            product p on c.CAT_ID = p.CAT_ID 
            inner join 
            product_details pd on p.PRO_ID = pd.PRO_ID 
            inner join 
            order_details o on o.PROD_ID = pd.PROD_ID 
            where ORD_AMOUNT in (select min(ORD_AMOUNT ) from order_details);"""

cursorObj.execute(Query6)

output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['CATEGORY ID','CATEGORY NAME'])
output_df

   CATEGORY ID CATEGORY NAME
0            3     GROCERIES

In [18]:
query7 = """select o.PROD_ID, p.PRO_NAME from order_details o 
            inner join 
            product_details pd on o.PROD_ID = pd.PROD_ID
            inner join 
            product p on p.PRO_ID = pd.PRO_ID where ORD_DATE > '2021-10-05';"""

cursorObj.execute(query7)

output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['PRODUCT ID','PRODUCT NAME'])
output_df

   PRODUCT ID PRODUCT NAME
0           5         OATS
1           1        GTA V

In [19]:
Query8=     """select s.SUPP_ID  , s.SUPP_NAME, c.CUS_NAME, r.RAT_RATSTARS from supplier s
               inner join rating r on s.SUPP_ID = r.SUPP_ID
               inner join customer c on r.CUS_ID = c.CUS_ID order by r.RAT_RATSTARS desc limit 3"""

cursorObj.execute(Query8)
output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['SUPPLIER ID','SUPPLIER NAME','CUSOMER NAME','RATINGS'])
output_df

   SUPPLIER ID   SUPPLIER NAME CUSOMER NAME  RATINGS
0            1  Rajesh Retails       PULKIT        5
1            2    Appario Ltd.         AMAN        4
2            5     Mittal Ltd.        MEGHA        4

In [20]:
Query9 = """select CUS_NAME, CUS_GENDER FROM customer WHERE CUS_NAME like 'A%A';"""

cursorObj.execute(Query9)
output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['CUSTOMER NAME', 'GENDER'])
output_df

Empty DataFrame
Columns: [CUSTOMER NAME, GENDER]
Index: []

In [21]:
Query10=  """select sum(o.ord_amount) as Amount from `order_details` o 
             inner join customer c on o.cus_id = c.cus_id where c.cus_gender='M';"""

cursorObj.execute(Query10)
output = cursorObj.fetchall()

print("Amount is ",output);

Amount is  [(Decimal('34500'),)]

In [22]:
Query11 = """select c.CUS_ID, c.CUS_NAME, c.CUS_PHONE ,c.CUS_CITY, c.CUS_GENDER,
             o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE, o.PROD_ID  from customer c
             LEFT OUTER JOIN order_details o ON c.CUS_ID = o.CUS_ID;"""

cursorObj.execute(Query11)
output = cursorObj.fetchall()

output_df = pd.DataFrame(output, columns=['CUSTOMER ID', 'CUSTOMER NAME', 'PHONE NUMBER', 'CITY', 'GENDER', 'ORDER ID', 'AMOUNT', 'DATE', 'PRODUCT ID'])
output_df

,CUSTOMER ID,CUSTOMER NAME,PHONE NUMBER,CITY,GENDER,ORDER ID,AMOUNT,DATE,PRODUCT ID
0,1,AKASH,1234567890,Delhi,M,26,2000,2021-10-05,1
1,2,AMAN,1614322387,NOIDA,M,50,2000,2021-10-06,1
2,3,NEHA,1871614322,Mumbai,F,20,1500,2021-10-12,5
3,4,MEGHA,1000614322,KOLKATA,F,30,3500,2021-08-16,3
4,5,PULKIT,1614322551,Lucknow,M,25,30500,2021-09-16,2

In [23]:
connection.close()